TableFile_error/crashing_run/inertial_0.2Mach_NACA0012_1e-3_6procs/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          160;
        startFace       57022;
    }
    inlet
    {
        type            patch;
        nFaces          104;
        startFace       57182;
    }
    outlet
    {
        type            patch;
        nFaces          104;
        startFace       57286;
    }
    wing
    {
        type            wall;
        inGroups        1(wall);
        nFaces          216;
        startFace       57390;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          28394;
        startFace       57606;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          28394;
        startFace       86000;
    }
)

// ************************************************************************* //
