TableFile_error/crashing_run/inertial_0.2Mach_NACA0012_1e-3_6procs/0.org/include/data/run.sh
#!/bin/bash

python timevaryingbc.py > dataFile
python timevaryingbc.py > inletFile
